{
  "sets": [
    {
      "era": "Ancient Egypt",
      "words": [
        {
          "word": "PHARAOH",
          "translations": {
            "en": "PHARAOH",
            "tr": "FİRAVUN"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ ruled over Egypt with great power.",
            "Who built the huge pyramids in ancient Egypt? The _____"
          ],
          "didYouKnow": "The word Pharaoh means 'Great House' in ancient Egyptian. Pharaohs wore a double crown: red for Lower Egypt and white for Upper Egypt!"
        },
        {
          "word": "PYRAMID",
          "translations": {
            "en": "PYRAMID",
            "tr": "PİRAMİT"
          },
          "difficulty": "easy",
          "sentences": [
            "The great _____ was built from stone blocks.",
            "What ancient structure served as a tomb for the pharaoh? The _____"
          ],
          "didYouKnow": "The Great Pyramid of Giza used over 2.3 million stone blocks, each weighing 2.5 to 15 tons. It remained the tallest building in the world for 3,800 years!"
        },
        {
          "word": "SPHINX",
          "translations": {
            "en": "SPHINX",
            "tr": "SFENKS"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ has a lion's body and human head.",
            "What famous statue guards the pyramids? The _____"
          ],
          "didYouKnow": "The Great Sphinx is 240 feet long and 66 feet high. Its nose was damaged in the 14th century, not by Napoleon's troops as commonly believed!"
        },
        {
          "word": "MUMMY",
          "translations": {
            "en": "MUMMY",
            "tr": "MUMYA"
          },
          "difficulty": "easy",
          "sentences": [
            "A _____ is a preserved body wrapped in cloth.",
            "What was created to protect the pharaoh's body in the afterlife? A _____"
          ],
          "didYouKnow": "The mummification process took 70 days! The brain was removed through the nose, and the organs were stored in special jars called canopic jars."
        },
        {
          "word": "GOLD",
          "translations": {
            "en": "GOLD",
            "tr": "ALTIN"
          },
          "difficulty": "easy",
          "sentences": [
            "The pharaoh's mask was made of _____.",
            "What precious metal was used in ancient Egyptian jewelry? _____"
          ],
          "didYouKnow": "The ancient Egyptians believed gold was the flesh of the gods. It was used in jewelry, statues, and even to decorate tombs!"
        },
        {
          "word": "TOMB",
          "translations": {
            "en": "TOMB",
            "tr": "MEZAR"
          },
          "difficulty": "normal",
          "sentences": [
            "The pharaoh's _____ was filled with treasures.",
            "Where were the pharaohs buried? In a _____"
          ],
          "didYouKnow": "The tombs in the Valley of the Kings were filled with treasures to help the pharaohs in the afterlife. Many were robbed in ancient times!"
        },
        {
          "word": "NILE",
          "translations": {
            "en": "NILE",
            "tr": "NİL"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ River was the lifeblood of ancient Egypt.",
            "What river provided water and fertile soil to ancient Egypt? The _____"
          ],
          "didYouKnow": "The Nile is the longest river in the world, stretching over 4,000 miles. Ancient Egyptians called it 'Ar' or 'Black,' because of the rich black soil it left behind after flooding."
        },
        {
          "word": "QUEEN",
          "translations": {
            "en": "QUEEN",
            "tr": "KRALİÇE"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ ruled alongside the pharaoh.",
            "Who was the most famous female ruler of ancient Egypt? The _____"
          ],
          "didYouKnow": "Queen Hatshepsut was one of the most successful pharaohs of ancient Egypt. She ruled for over 20 years and built many monuments!"
        },
        {
          "word": "SAND",
          "translations": {
            "en": "SAND",
            "tr": "KUM"
          },
          "difficulty": "easy",
          "sentences": [
            "The desert _____ covered much of Egypt.",
            "What covered the land outside the Nile Valley? _____"
          ],
          "didYouKnow": "The Sahara Desert, which covers most of Egypt, is the largest hot desert in the world. It was once a lush, green land thousands of years ago!"
        },
        {
          "word": "CAT",
          "translations": {
            "en": "CAT",
            "tr": "KEDİ"
          },
          "difficulty": "easy",
          "sentences": [
            "The ancient Egyptians worshipped the _____.",
            "What animal was considered sacred in ancient Egypt? The _____"
          ],
          "didYouKnow": "Cats were so sacred in ancient Egypt that killing one, even accidentally, was punishable by death. They were believed to bring good luck!"
        },
        {
          "word": "SCARAB",
          "translations": {
            "en": "SCARAB",
            "tr": "SKARABE"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ was a symbol of rebirth in ancient Egypt.",
            "What beetle was considered sacred by the ancient Egyptians? The _____"
          ],
          "didYouKnow": "Scarab beetles were associated with the sun god Ra. They were often used in jewelry and amulets to protect the wearer."
        },
        {
          "word": "PAPYRUS",
          "translations": {
            "en": "PAPYRUS",
            "tr": "PAPİRÜS"
          },
          "difficulty": "normal",
          "sentences": [
            "The ancient Egyptians wrote on _____.",
            "What plant was used to make paper in ancient Egypt? _____"
          ],
          "didYouKnow": "Papyrus was made from the stem of the papyrus plant. It was used for writing, making boats, and even sandals!"
        },
        {
          "word": "OSIRIS",
          "translations": {
            "en": "OSIRIS",
            "tr": "OSİRİS"
          },
          "difficulty": "hard",
          "sentences": [
            "_____ was the god of the afterlife.",
            "Who was the ancient Egyptian god of the dead? _____"
          ],
          "didYouKnow": "Osiris was one of the most important gods in ancient Egypt. He was killed by his brother Seth but was brought back to life by his wife Isis."
        },
        {
          "word": "CANOPIC",
          "translations": {
            "en": "CANOPIC",
            "tr": "KANOPİK"
          },
          "difficulty": "hard",
          "sentences": [
            "The _____ jars held the organs of the mummy.",
            "What jars were used to store the organs during mummification? _____ jars"
          ],
          "didYouKnow": "Canopic jars were often decorated with the heads of the four sons of Horus. Each jar held a different organ: liver, lungs, stomach, and intestines."
        },
        {
          "word": "HORUS",
          "translations": {
            "en": "HORUS",
            "tr": "HORUS"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ was the falcon-headed god of the sky.",
            "Who was the ancient Egyptian god of the sky? _____"
          ],
          "didYouKnow": "Horus was often depicted as a falcon or a man with a falcon's head. He was the son of Osiris and Isis and was associated with kingship."
        }
      ]
    },
    {
      "era": "Medieval Europe",
      "words": [
        {
          "word": "CASTLE",
          "translations": {
            "en": "CASTLE",
            "tr": "ŞATO"
          },
          "difficulty": "easy",
          "sentences": [
            "A _____ was built to protect towns and nobles from invaders.",
            "What structure had walls fifteen feet thick for defense? The _____"
          ],
          "didYouKnow": "Medieval castle walls were built with a gap in the middle filled with rubble. During sieges, this design helped absorb the impact of catapult stones!"
        },
        {
          "word": "KNIGHT",
          "translations": {
            "en": "KNIGHT",
            "tr": "ŞÖVALYE"
          },
          "difficulty": "easy",
          "sentences": [
            "A _____ trained from childhood to fight and serve nobles.",
            "Who followed a code of honor called chivalry? The _____"
          ],
          "didYouKnow": "A knight's full plate armor weighed about 50-60 pounds, but was so well distributed that they could still mount a horse and fight effectively!"
        },
        {
          "word": "KING",
          "translations": {
            "en": "KING",
            "tr": "KRAL"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ was believed to rule by divine right.",
            "Who granted land to nobles in exchange for loyalty? The _____"
          ],
          "didYouKnow": "Medieval kings were believed to have healing powers. English and French kings would touch people with skin diseases, called 'the king's evil,' in healing ceremonies!"
        },
        {
          "word": "SWORD",
          "translations": {
            "en": "SWORD",
            "tr": "KILIÇ"
          },
          "difficulty": "easy",
          "sentences": [
            "A medieval _____ took months to craft by hand.",
            "What weapon was a symbol of knighthood? The _____"
          ],
          "didYouKnow": "Medieval swordsmiths folded steel hundreds of times to create strong, flexible blades. Many swords had names and were believed to have magical powers!"
        },
        {
          "word": "CROWN",
          "translations": {
            "en": "CROWN",
            "tr": "TAÇ"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ represented the king's power and authority.",
            "What royal item contained precious gems and metals? The _____"
          ],
          "didYouKnow": "Medieval crowns were often adjusted to fit different heads. The British Crown Jewels were once pawned to pay for soldiers during the Civil War!"
        },
        {
          "word": "PEASANT",
          "translations": {
            "en": "PEASANT",
            "tr": "KÖYLÜ"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ worked the land to grow food for the kingdom.",
            "Who paid taxes to their lord in crops or labor? The _____"
          ],
          "didYouKnow": "Medieval peasants actually worked fewer hours than modern people. They had about 150 days off per year for religious festivals and holidays!"
        },
        {
          "word": "MONK",
          "translations": {
            "en": "MONK",
            "tr": "KEŞİŞ"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ preserved knowledge by copying books by hand.",
            "Who lived and worked in monasteries? The _____"
          ],
          "didYouKnow": "Medieval monks invented the mechanical clock to ensure they never missed prayer times. They also preserved ancient knowledge by copying thousands of books by hand!"
        },
        {
          "word": "GUILD",
          "translations": {
            "en": "GUILD",
            "tr": "LONCA"
          },
          "difficulty": "hard",
          "sentences": [
            "A _____ trained new craftsmen in specific trades.",
            "What organization protected the secrets of their craft? The _____"
          ],
          "didYouKnow": "Guild apprentices started training as young as 7 years old. It took 7 years to become a journeyman and many more to become a master!"
        },
        {
          "word": "ARMOR",
          "translations": {
            "en": "ARMOR",
            "tr": "ZIRH"
          },
          "difficulty": "normal",
          "sentences": [
            "Medieval _____ was made from iron or steel plates.",
            "What protection could weigh up to 100 pounds? _____"
          ],
          "didYouKnow": "Knights could run, mount horses, and even do cartwheels in full plate armor. Each suit was custom-made and as flexible as a modern firefighter's gear!"
        },
        {
          "word": "FEUDALISM",
          "translations": {
            "en": "FEUDALISM",
            "tr": "FEODALİZM"
          },
          "difficulty": "hard",
          "sentences": [
            "_____ was the social system of medieval Europe.",
            "What system organized society into lords, vassals, and peasants? _____"
          ],
          "didYouKnow": "Under feudalism, even kings had obligations to their vassals. A lord could not take back land from a vassal without proper cause and a court hearing!"
        },
        {
          "word": "VILLAGE",
          "translations": {
            "en": "VILLAGE",
            "tr": "KÖY"
          },
          "difficulty": "easy",
          "sentences": [
            "A medieval _____ was home to farmers and craftsmen.",
            "Where did most people live in the Middle Ages? In a _____"
          ],
          "didYouKnow": "Medieval villages were often built around a green, where villagers grazed animals and held festivals. Many modern English villages still have their original layout!"
        },
        {
          "word": "CHURCH",
          "translations": {
            "en": "CHURCH",
            "tr": "KİLİSE"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ was the center of community life.",
            "What building was the tallest in most medieval towns? The _____"
          ],
          "didYouKnow": "Medieval churches used stained glass windows to teach Bible stories to people who couldn't read. Some of these windows have survived for over 800 years!"
        },
        {
          "word": "FEAST",
          "translations": {
            "en": "FEAST",
            "tr": "ŞÖLEN"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ was held to celebrate special occasions.",
            "What event brought people together for food and music? A _____"
          ],
          "didYouKnow": "Medieval feasts could last for days! Exotic dishes like peacock were served with the feathers reattached to impress guests!"
        },
        {
          "word": "HERALD",
          "translations": {
            "en": "HERALD",
            "tr": "TELLAL"
          },
          "difficulty": "hard",
          "sentences": [
            "A _____ delivered important messages for the king.",
            "Who announced news and proclamations in the town square? The _____"
          ],
          "didYouKnow": "Heralds were considered sacred messengers. Even in wartime, they could not be harmed while wearing their official coat of arms!"
        },
        {
          "word": "TOURNAMENT",
          "translations": {
            "en": "TOURNAMENT",
            "tr": "TURNUVA"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ was a contest of skill for knights.",
            "What event featured jousting and sword fights? The _____"
          ],
          "didYouKnow": "Medieval tournaments were more dangerous than battles! More knights died in tournament accidents than in actual combat!"
        }
      ]
    },
    {
      "era": "Renaissance",
      "words": [
        {
          "word": "MERCHANT",
          "translations": {
            "en": "MERCHANT",
            "tr": "TÜCCAR"
          },
          "difficulty": "normal",
          "sentences": [
            "The wealthy _____ class helped fund the Renaissance art movement.",
            "Who brought exotic goods to European markets? The _____"
          ],
          "didYouKnow": "Renaissance merchants created the first banks in Italy. The word 'bank' comes from 'banca', the benches they used to display their coins and conduct business!"
        },
        {
          "word": "ARTIST",
          "translations": {
            "en": "ARTIST",
            "tr": "SANATÇI"
          },
          "difficulty": "easy",
          "sentences": [
            "An _____ during the Renaissance studied human anatomy.",
            "Who mixed their own paint colors from natural materials? The _____"
          ],
          "didYouKnow": "Renaissance artists dissected human bodies to better understand anatomy. Leonardo da Vinci performed over 30 secret autopsies to improve his paintings!"
        },
        {
          "word": "PAINT",
          "translations": {
            "en": "PAINT",
            "tr": "BOYA"
          },
          "difficulty": "easy",
          "sentences": [
            "Renaissance artists made _____ from egg yolk and pigments.",
            "What new invention allowed for richer colors in artwork? _____"
          ],
          "didYouKnow": "Renaissance artists developed oil paints, which dried slower than tempera, allowing for more detailed work and blending of colors!"
        },
        {
          "word": "PATRON",
          "translations": {
            "en": "PATRON",
            "tr": "HAMİ"
          },
          "difficulty": "normal",
          "sentences": [
            "A wealthy _____ would support artists and their work.",
            "Who commissioned many great works of art? The _____"
          ],
          "didYouKnow": "The Medici family, famous Renaissance patrons, sponsored so many artists that they nearly bankrupted their bank. They funded over 50 artists including Michelangelo!"
        },
        {
          "word": "PRINT",
          "translations": {
            "en": "PRINT",
            "tr": "MATBAA"
          },
          "difficulty": "normal",
          "sentences": [
            "The printing _____ helped spread new ideas quickly.",
            "What invention made books more affordable? The _____ press"
          ],
          "didYouKnow": "Gutenberg's printing press could produce 3,600 pages per day. Before this, a monk could only copy about 4 pages per day by hand!"
        },
        {
          "word": "BANK",
          "translations": {
            "en": "BANK",
            "tr": "BANKA"
          },
          "difficulty": "normal",
          "sentences": [
            "The first modern _____ system started in Renaissance Italy.",
            "What institution helped fund trade across Europe? The _____"
          ],
          "didYouKnow": "The first banks in Renaissance Italy issued letters of credit, allowing merchants to travel without carrying large amounts of gold!"
        },
        {
          "word": "TRADE",
          "translations": {
            "en": "TRADE",
            "tr": "TİCARET"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ routes connected Europe with distant Asia.",
            "What activity made many merchants wealthy? _____"
          ],
          "didYouKnow": "Venice became so rich from trade that its merchants used marble to build their warehouses, while other cities were still using wood!"
        },
        {
          "word": "ANATOMY",
          "translations": {
            "en": "ANATOMY",
            "tr": "ANATOMİ"
          },
          "difficulty": "hard",
          "sentences": [
            "Renaissance artists studied _____ to draw the human body more realistically.",
            "How did Leonardo da Vinci's drawings include detailed human _____?"
          ],
          "didYouKnow": "Leonardo da Vinci performed over 30 secret autopsies to better understand human anatomy. These studies revolutionized both medicine and art!"
        },
        {
          "word": "SCIENCE",
          "translations": {
            "en": "SCIENCE",
            "tr": "BİLİM"
          },
          "difficulty": "easy",
          "sentences": [
            "_____ began to challenge old beliefs about the world.",
            "What field laid the foundation for modern research? _____"
          ],
          "didYouKnow": "Renaissance scientists like Galileo used experiments to test their ideas, marking the beginning of the scientific method!"
        },
        {
          "word": "BOOK",
          "translations": {
            "en": "BOOK",
            "tr": "KİTAP"
          },
          "difficulty": "easy",
          "sentences": [
            "Printed _____ made knowledge available to more people.",
            "What once cost as much as a house? A _____"
          ],
          "didYouKnow": "Before the printing press, books were so valuable that they were often chained to library shelves to prevent theft!"
        },
        {
          "word": "SCULPTURE",
          "translations": {
            "en": "SCULPTURE",
            "tr": "HEYKEL"
          },
          "difficulty": "normal",
          "sentences": [
            "Renaissance _____ showed realistic human forms.",
            "What art form used marble to create lifelike figures? _____"
          ],
          "didYouKnow": "Michelangelo's David was carved from a single block of marble that other sculptors had rejected as too flawed. It took him three years to complete!"
        },
        {
          "word": "PERSPECTIVE",
          "translations": {
            "en": "PERSPECTIVE",
            "tr": "PERSPEKTİF"
          },
          "difficulty": "hard",
          "sentences": [
            "Artists used _____ to make paintings look more real.",
            "What technique made objects appear farther away? _____"
          ],
          "didYouKnow": "Renaissance artists discovered that all parallel lines appear to meet at a single 'vanishing point'. This mathematical discovery revolutionized painting!"
        },
        {
          "word": "HUMANISM",
          "translations": {
            "en": "HUMANISM",
            "tr": "HÜMANİZM"
          },
          "difficulty": "hard",
          "sentences": [
            "_____ focused on human potential and achievements.",
            "What philosophy valued individual thought and creativity? _____"
          ],
          "didYouKnow": "Humanist scholars believed in the potential of human beings to improve themselves and society through education and reason!"
        },
        {
          "word": "LOCOMOTIVE",
          "translations": {
            "en": "LOCOMOTIVE",
            "tr": "LOKOMOTİF"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ changed how people and goods moved across countries.",
            "What steam-powered machine transformed transportation? The _____"
          ],
          "didYouKnow": "The first steam locomotives were developed during the Renaissance, though they were not widely used until the Industrial Revolution!"
        },
        {
          "word": "ARCHITECTURE",
          "translations": {
            "en": "ARCHITECTURE",
            "tr": "MİMARLIK"
          },
          "difficulty": "normal",
          "sentences": [
            "Renaissance _____ used symmetry and proportion.",
            "What art form created beautiful buildings and domes? _____"
          ],
          "didYouKnow": "Renaissance architects studied ancient Roman buildings to rediscover classical techniques, leading to the development of domes and arches!"
        }
      ]
    },
    {
      "era": "Industrial Revolution",
      "words": [
        {
          "word": "FACTORY",
          "translations": {
            "en": "FACTORY",
            "tr": "FABRİKA"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ system revolutionized how goods were produced.",
            "Where did workers gather to operate machinery? The _____"
          ],
          "didYouKnow": "The first factories were powered by water wheels, but steam engines soon took over, allowing factories to be built anywhere!"
        },
        {
          "word": "STEAM",
          "translations": {
            "en": "STEAM",
            "tr": "BUHAR"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ power drove the engines of the Industrial Revolution.",
            "What type of engine transformed transportation? The _____ engine"
          ],
          "didYouKnow": "The first practical steam engine was invented by Thomas Newcomen in 1712, but James Watt's improvements made it widely useful!"
        },
        {
          "word": "COAL",
          "translations": {
            "en": "COAL",
            "tr": "KÖMÜR"
          },
          "difficulty": "easy",
          "sentences": [
            "_____ mining fueled the Industrial Revolution.",
            "What powered the steam engines in factories? _____"
          ],
          "didYouKnow": "Coal mining was extremely dangerous, with frequent cave-ins and explosions. Children as young as 5 worked in the mines!"
        },
        {
          "word": "IRON",
          "translations": {
            "en": "IRON",
            "tr": "DEMİR"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ production increased greatly during this period.",
            "What material was used to make machines and railways? _____"
          ],
          "didYouKnow": "The Bessemer process, invented in 1856, made steel production faster and cheaper, revolutionizing construction!"
        },
        {
          "word": "TRAIN",
          "translations": {
            "en": "TRAIN",
            "tr": "TREN"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ network connected cities across countries.",
            "What made travel cheaper and more accessible? The _____"
          ],
          "didYouKnow": "The first passenger railway opened in 1825 in England. Trains could travel at 15 mph, much faster than horse-drawn carriages!"
        },
        {
          "word": "WORKER",
          "translations": {
            "en": "WORKER",
            "tr": "İŞÇİ"
          },
          "difficulty": "easy",
          "sentences": [
            "Factory _____ often worked twelve hours each day.",
            "Who moved from farms to cities for factory jobs? _____"
          ],
          "didYouKnow": "Factory workers, including children, often worked 14-16 hour days in dangerous conditions with no safety regulations!"
        },
        {
          "word": "CITY",
          "translations": {
            "en": "CITY",
            "tr": "ŞEHİR"
          },
          "difficulty": "easy",
          "sentences": [
            "Industrial _____ grew rapidly as people sought factory work.",
            "What doubled in population during industrialization? The _____"
          ],
          "didYouKnow": "Cities like Manchester and Birmingham grew rapidly, but overcrowding led to poor sanitation and disease outbreaks!"
        },
        {
          "word": "MACHINE",
          "translations": {
            "en": "MACHINE",
            "tr": "MAKİNE"
          },
          "difficulty": "normal",
          "sentences": [
            "New _____ tools replaced hand production methods.",
            "What could do the work of many people? A _____"
          ],
          "didYouKnow": "The spinning jenny, invented in 1764, could spin 8 threads at once, revolutionizing the textile industry!"
        },
        {
          "word": "COTTON",
          "translations": {
            "en": "COTTON",
            "tr": "PAMUK"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ gin made cleaning cotton much faster.",
            "What type of clothing became cheaper to produce? _____ clothing"
          ],
          "didYouKnow": "Eli Whitney's cotton gin, invented in 1793, could clean 50 pounds of cotton a day, compared to 1 pound by hand!"
        },
        {
          "word": "CHILD",
          "translations": {
            "en": "CHILD",
            "tr": "ÇOCUK"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ workers were common in early factories.",
            "Who worked in dangerous factory conditions? _____ workers"
          ],
          "didYouKnow": "Children as young as 6 worked in factories, often in dangerous jobs like cleaning machinery while it was running!"
        },
        {
          "word": "TEXTILE",
          "translations": {
            "en": "TEXTILE",
            "tr": "TEKSTİL"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ industry was one of the first to be mechanized.",
            "What industry made cloth and clothing? The _____ industry"
          ],
          "didYouKnow": "The power loom, invented in 1785, could weave cloth much faster than hand looms, making textiles cheaper!"
        },
        {
          "word": "RAILWAY",
          "translations": {
            "en": "RAILWAY",
            "tr": "DEMİRYOLU"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ system connected cities and towns.",
            "What transportation system changed how goods were moved? The _____"
          ],
          "didYouKnow": "The first public railway opened in 1825 in England. By 1850, Britain had over 6,000 miles of track!"
        },
        {
          "word": "İCAT",
          "translations": {
            "en": "INVENTION",
            "tr": "İCAT"
          },
          "difficulty": "easy",
          "sentences": [
            "Rönesans büyük _____ların zamanıydı.",
            "Dünyayı değiştiren yeni buluşları tanımlayan kelime neydi? _____"
          ],
          "didYouKnow": "Rönesans, buhar motoru, iplik eğirme makinesi ve dokuma tezgahı gibi icatlarla toplumu dönüştürdü!"
        },
        {
          "word": "LABOR",
          "translations": {
            "en": "LABOR",
            "tr": "EMEK"
          },
          "difficulty": "normal",
          "sentences": [
            "Factory _____ was often hard and dangerous.",
            "What did workers provide in exchange for wages? _____"
          ],
          "didYouKnow": "Labor unions formed to fight for better working conditions, leading to laws limiting work hours and child labor!"
        },
        {
          "word": "UNION",
          "translations": {
            "en": "UNION",
            "tr": "SENDİKA"
          },
          "difficulty": "hard",
          "sentences": [
            "Workers formed a _____ to fight for better conditions.",
            "What organization protected workers' rights? A _____"
          ],
          "didYouKnow": "The first labor unions were illegal, but they eventually won rights like the 8-hour workday and safer factories!"
        }
      ]
    },
    {
      "era": "Ancient Greece",
      "words": [
        {
          "word": "DEMOCRACY",
          "translations": {
            "en": "DEMOCRACY",
            "tr": "DEMOKRASİ"
          },
          "difficulty": "normal",
          "sentences": [
            "Athenian _____ allowed citizens to vote on important matters.",
            "What system gave power to the people rather than a single ruler? _____"
          ],
          "didYouKnow": "Athenian democracy was direct, not representative. Citizens voted on laws and policies themselves, not through elected officials!"
        },
        {
          "word": "OLYMPICS",
          "translations": {
            "en": "OLYMPICS",
            "tr": "OLİMPİYAT"
          },
          "difficulty": "easy",
          "sentences": [
            "The ancient _____ were held every four years in Greece.",
            "What events were held in honor of Zeus? The _____"
          ],
          "didYouKnow": "The ancient Olympics lasted for over 1,000 years, from 776 BC to 393 AD. Winners received olive wreaths instead of medals!"
        },
        {
          "word": "THEATER",
          "translations": {
            "en": "THEATER",
            "tr": "TİYATRO"
          },
          "difficulty": "normal",
          "sentences": [
            "Greek _____ invented tragedy and comedy plays.",
            "Where did actors wear masks to show emotions? The _____"
          ],
          "didYouKnow": "Ancient Greek theaters could seat up to 15,000 people. The masks helped actors project their voices and play multiple roles!"
        },
        {
          "word": "SPARTA",
          "translations": {
            "en": "SPARTA",
            "tr": "SPARTA"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ was famous for its powerful army.",
            "Which city trained boys to be warriors from age seven? _____"
          ],
          "didYouKnow": "Spartan boys left home at age 7 for military training. They were taught to steal food to survive, but were punished if caught!"
        },
        {
          "word": "ATHENS",
          "translations": {
            "en": "ATHENS",
            "tr": "ATİNA"
          },
          "difficulty": "easy",
          "sentences": [
            "_____ was the birthplace of democracy.",
            "Which city was a center of art, learning, and philosophy? _____"
          ],
          "didYouKnow": "Athens was named after Athena, the goddess of wisdom. The Parthenon was built in her honor on the Acropolis!"
        },
        {
          "word": "PHILOSOPHER",
          "translations": {
            "en": "PHILOSOPHER",
            "tr": "FİLOZOF"
          },
          "difficulty": "normal",
          "sentences": [
            "A Greek _____ asked questions about life and truth.",
            "Who taught their students through asking questions? The _____"
          ],
          "didYouKnow": "Socrates, the famous Greek philosopher, never wrote anything down. We know about his ideas through his student Plato's writings!"
        },
        {
          "word": "POTTERY",
          "translations": {
            "en": "POTTERY",
            "tr": "ÇÖMLEK"
          },
          "difficulty": "normal",
          "sentences": [
            "Greek _____ told stories through painted scenes.",
            "What helps us learn about ancient Greek culture? _____"
          ],
          "didYouKnow": "Greek pottery was often decorated with scenes from myths and daily life. The black-figure and red-figure styles are famous!"
        },
        {
          "word": "TEMPLE",
          "translations": {
            "en": "TEMPLE",
            "tr": "TAPINAK"
          },
          "difficulty": "normal",
          "sentences": [
            "A Greek _____ was built to honor the gods.",
            "What building had tall columns and marble steps? The _____"
          ],
          "didYouKnow": "Greek temples were brightly painted, not white as they appear today. The paint has faded over thousands of years!"
        },
        {
          "word": "MYTH",
          "translations": {
            "en": "MYTH",
            "tr": "MİT"
          },
          "difficulty": "normal",
          "sentences": [
            "Greek _____ stories explained the world around them.",
            "What type of stories featured gods and heroes? _____"
          ],
          "didYouKnow": "The Greek myths were originally passed down orally. Homer's Iliad and Odyssey were the first to be written down!"
        },
        {
          "word": "MATHEMATICS",
          "translations": {
            "en": "MATHEMATICS",
            "tr": "MATEMATİK"
          },
          "difficulty": "hard",
          "sentences": [
            "How did scientists like Pythagoras and Euclid revolutionize the field of _____?",
            "In ancient Greece, what was the field that studied numbers and shapes? _____"
          ],
          "didYouKnow": "The Pythagorean theorem was discovered by the ancient Greek mathematician Pythagoras and is still taught in geometry classes today!"
        },
        {
          "word": "ACROPOLIS",
          "translations": {
            "en": "ACROPOLIS",
            "tr": "AKROPOL"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ was the high city in Athens.",
            "What hilltop was the center of ancient Athens? The _____"
          ],
          "didYouKnow": "The Acropolis means 'high city' in Greek. It was both a religious center and a fortress during attacks!"
        },
        {
          "word": "OLIVE",
          "translations": {
            "en": "OLIVE",
            "tr": "ZEYTİN"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ tree was sacred to the Greeks.",
            "What plant provided food, oil, and wood? The _____ tree"
          ],
          "didYouKnow": "Olive oil was so valuable in ancient Greece that it was used as currency, medicine, and even as fuel for lamps!"
        },
        {
          "word": "ZEUS",
          "translations": {
            "en": "ZEUS",
            "tr": "ZEUS"
          },
          "difficulty": "easy",
          "sentences": [
            "_____ was the king of the Greek gods.",
            "Who ruled from Mount Olympus? _____"
          ],
          "didYouKnow": "Zeus was known for his thunderbolts. The ancient Greeks believed lightning was a sign of Zeus's anger!"
        },
        {
          "word": "ATHLETE",
          "translations": {
            "en": "ATHLETE",
            "tr": "ATLET"
          },
          "difficulty": "easy",
          "sentences": [
            "An _____ trained for the Olympic games.",
            "Who competed in running and wrestling? An _____"
          ],
          "didYouKnow": "Ancient Greek athletes competed naked in the Olympics. The word 'gymnasium' comes from 'gymnos', meaning naked!"
        },
        {
          "word": "MARATHON",
          "translations": {
            "en": "MARATHON",
            "tr": "MARATON"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ race comes from an ancient Greek story.",
            "What long-distance race has its origins in Greece? The _____"
          ],
          "didYouKnow": "The marathon race is based on the legend of Pheidippides, who ran from Marathon to Athens to announce a Greek victory over Persia!"
        }
      ]
    },
    {
      "era": "Viking Age",
      "words": [
        {
          "word": "RAID",
          "translations": {
            "en": "RAID",
            "tr": "AKIN"
          },
          "difficulty": "normal",
          "sentences": [
            "A Viking _____ was a quick attack on coastal towns.",
            "What did Vikings do to gather wealth and resources? A _____"
          ],
          "didYouKnow": "Viking raids were often seasonal, taking place in summer when the seas were calm. They targeted monasteries because they were rich and undefended!"
        },
        {
          "word": "HELMET",
          "translations": {
            "en": "HELMET",
            "tr": "MİĞFER"
          },
          "difficulty": "easy",
          "sentences": [
            "A Viking warrior's _____ protected his head in battle.",
            "What armor piece is often shown with horns, though real ones didn't have them? The _____"
          ],
          "didYouKnow": "Viking helmets didn't actually have horns! This myth was created by 19th-century artists. Real helmets were simple and practical!"
        },
        {
          "word": "RUNES",
          "translations": {
            "en": "RUNES",
            "tr": "RUN"
          },
          "difficulty": "hard",
          "sentences": [
            "Vikings carved _____ into stone to tell stories.",
            "What was the Viking writing system called? _____"
          ],
          "didYouKnow": "Runes were believed to have magical powers. Vikings used them for protection, healing, and even to curse their enemies!"
        },
        {
          "word": "FJORD",
          "translations": {
            "en": "FJORD",
            "tr": "FİYORT"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ is a long, narrow inlet with steep cliffs.",
            "What geological feature shaped Viking settlements in Norway? The _____"
          ],
          "didYouKnow": "Fjords were perfect for Viking ships. Their deep waters allowed ships to sail far inland, while the cliffs provided natural defenses!"
        },
        {
          "word": "VALHALLA",
          "translations": {
            "en": "VALHALLA",
            "tr": "VALHALLA"
          },
          "difficulty": "hard",
          "sentences": [
            "Vikings believed warriors went to _____ after death.",
            "What was the great hall of Odin called in Norse mythology? _____"
          ],
          "didYouKnow": "In Valhalla, warriors feasted and fought all day, then were healed at night. They prepared for Ragnarok, the final battle of the gods!"
        },
        {
          "word": "THOR",
          "translations": {
            "en": "THOR",
            "tr": "THOR"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ was the Norse god of thunder.",
            "Which god carried a hammer called Mjölnir? _____"
          ],
          "didYouKnow": "Thor's hammer, Mjölnir, was so powerful that it required special gloves to hold. It always returned to Thor's hand after being thrown!"
        },
        {
          "word": "BESERKER",
          "translations": {
            "en": "BESERKER",
            "tr": "BESERKER"
          },
          "difficulty": "hard",
          "sentences": [
            "A _____ was a fierce Viking warrior who fought in a trance.",
            "What type of warrior was known for their wild battle rage? The _____"
          ],
          "didYouKnow": "Berserkers were said to fight without armor, in a frenzy. The word 'berserk' comes from their name, meaning 'bear shirt'!"
        },
        {
          "word": "SKALD",
          "translations": {
            "en": "SKALD",
            "tr": "OZAN"
          },
          "difficulty": "hard",
          "sentences": [
            "A _____ was a Viking poet who told stories of heroes.",
            "Who preserved Viking history through poems and songs? The _____"
          ],
          "didYouKnow": "Skalds were highly respected. Their poems, called sagas, were passed down orally for generations before being written down!"
        },
        {
          "word": "AXE",
          "translations": {
            "en": "AXE",
            "tr": "BALTA"
          },
          "difficulty": "normal",
          "sentences": [
            "A Viking warrior's _____ was both a tool and weapon.",
            "What weapon was commonly used by Viking warriors? The _____"
          ],
          "didYouKnow": "Viking axes were so well-made that they could split a shield or helmet with a single blow. They were also used for chopping wood!"
        },
        {
          "word": "VIKINGR",
          "translations": {
            "en": "VIKINGR",
            "tr": "VIKING"
          },
          "difficulty": "normal",
          "sentences": [
            "The word _____ originally meant 'pirate' or 'raider'.",
            "What did Vikings call themselves when they went raiding? _____"
          ],
          "didYouKnow": "Not all Norse people were Vikings. The term 'Viking' specifically referred to those who went on raids or trading expeditions!"
        },
        {
          "word": "LOKI",
          "translations": {
            "en": "LOKI",
            "tr": "LOKI"
          },
          "difficulty": "hard",
          "sentences": [
            "In Norse mythology, who was the god famous for his tricks and pranks? _____",
            "_____ was known as both a friend and an enemy of the gods."
          ],
          "didYouKnow": "Loki is a trickster god in Norse mythology. He is known as both a friend and an enemy of the gods and plays a key role in many legends!"
        },
        {
          "word": "ODIN",
          "translations": {
            "en": "ODIN",
            "tr": "ODİN"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ was the chief god in Norse mythology.",
            "Which god had two ravens named Huginn and Muninn? _____"
          ],
          "didYouKnow": "Odin sacrificed one of his eyes for wisdom. His ravens, Huginn (Thought) and Muninn (Memory), flew across the world to bring him news!"
        },
        {
          "word": "SAGA",
          "translations": {
            "en": "SAGA",
            "tr": "SAGA"
          },
          "difficulty": "hard",
          "sentences": [
            "What were the long poems that told the heroic stories of the Vikings called? _____",
            "_____s were legends passed down from generation to generation in Viking culture."
          ],
          "didYouKnow": "Sagas are long poems that tell the heroic stories, adventures, and mythological events of the Vikings. These stories are an important part of Viking culture and history!"
        },
        {
          "word": "SHIELD",
          "translations": {
            "en": "SHIELD",
            "tr": "KALKAN"
          },
          "difficulty": "normal",
          "sentences": [
            "A Viking warrior carried a round _____ for protection.",
            "What defensive item was often painted with symbols? The _____"
          ],
          "didYouKnow": "Viking shields were made of wood and covered with leather. They were often painted with bright colors and patterns to intimidate enemies!"
        },
        {
          "word": "NORSE",
          "translations": {
            "en": "NORSE",
            "tr": "İSKANDİNAV"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ people lived in Scandinavia.",
            "What culture is associated with Vikings? The _____ culture"
          ],
          "didYouKnow": "The Norse people were skilled sailors, traders, and craftsmen. They established settlements as far away as North America and the Middle East!"
        }
      ]
    },
    {
      "era": "Feudal Japan",
      "words": [
        {
          "word": "SAMURAI",
          "translations": {
            "en": "SAMURAI",
            "tr": "SAMURAY"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ were skilled warriors who followed a strict code.",
            "Who served as the military nobility in feudal Japan? The _____"
          ],
          "didYouKnow": "Samurai means 'one who serves'. They were not just warriors but also scholars, artists, and administrators!"
        },
        {
          "word": "SHOGUN",
          "translations": {
            "en": "SHOGUN",
            "tr": "ŞOGUN"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ was the military leader of Japan.",
            "Who had more power than the emperor in feudal Japan? The _____"
          ],
          "didYouKnow": "The Shogun was the real ruler of Japan, while the emperor was a figurehead. The Shogunate system lasted for nearly 700 years!"
        },
        {
          "word": "KATANA",
          "translations": {
            "en": "KATANA",
            "tr": "KATANA"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ was the long sword carried by samurai.",
            "What curved sword was the symbol of a samurai? The _____"
          ],
          "didYouKnow": "A katana was so sharp it could cut through a falling silk scarf. It took months to make and was considered the soul of the samurai!"
        },
        {
          "word": "DAIMYO",
          "translations": {
            "en": "DAIMYO",
            "tr": "DAİMYO"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ was a powerful land-owning lord.",
            "Who ruled over large territories in feudal Japan? The _____"
          ],
          "didYouKnow": "Daimyo were like kings in their own domains. They had their own armies of samurai and often fought each other for power!"
        },
        {
          "word": "BUSHIDO",
          "translations": {
            "en": "BUSHIDO",
            "tr": "BUSHİDO"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ was the code of honor followed by samurai.",
            "What code emphasized loyalty, courage, and discipline? _____"
          ],
          "didYouKnow": "Bushido means 'the way of the warrior'. It taught samurai to value honor above life itself, leading to the practice of seppuku (ritual suicide)!"
        },
        {
          "word": "NINJA",
          "translations": {
            "en": "NINJA",
            "tr": "NİNJA"
          },
          "difficulty": "easy",
          "sentences": [
            "A _____ was a skilled spy and assassin.",
            "Who used stealth and disguise to complete missions? The _____"
          ],
          "didYouKnow": "Ninjas were masters of disguise and could blend into any environment. They used tools like shuriken (throwing stars) and smoke bombs!"
        },
        {
          "word": "TEA",
          "translations": {
            "en": "TEA",
            "tr": "ÇAY"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ ceremony was an important cultural practice.",
            "What drink was central to Japanese rituals? _____"
          ],
          "didYouKnow": "The Japanese tea ceremony, or chanoyu, is a highly ritualized art form that can take years to master. It emphasizes harmony, respect, and tranquility!"
        },
        {
          "word": "ZEN",
          "translations": {
            "en": "ZEN",
            "tr": "ZEN"
          },
          "difficulty": "hard",
          "sentences": [
            "_____ Buddhism influenced Japanese art and culture.",
            "What philosophy focused on meditation and simplicity? _____"
          ],
          "didYouKnow": "Zen Buddhism teaches that enlightenment can be achieved through meditation and self-discipline. It greatly influenced samurai culture!"
        },
        {
          "word": "PAGODA",
          "translations": {
            "en": "PAGODA",
            "tr": "PAGODA"
          },
          "difficulty": "hard",
          "sentences": [
            "A _____ is a tiered tower with curved roofs.",
            "What type of building is common in Japanese temples? A _____"
          ],
          "didYouKnow": "Pagodas were originally built to house sacred relics. Their design is meant to symbolize the connection between heaven and earth!"
        },
        {
          "word": "KIMONO",
          "translations": {
            "en": "KIMONO",
            "tr": "KİMONO"
          },
          "difficulty": "easy",
          "sentences": [
            "A _____ is a traditional Japanese robe.",
            "What clothing item is worn with a wide belt? The _____"
          ],
          "didYouKnow": "Kimono means 'thing to wear'. They are made from a single bolt of fabric and can take up to a year to make by hand!"
        },
        {
          "word": "GEISHA",
          "translations": {
            "en": "GEISHA",
            "tr": "GEYŞA"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ was a trained entertainer and artist.",
            "Who performed music, dance, and tea ceremonies? The _____"
          ],
          "didYouKnow": "Geisha means 'person of the arts'. They were highly skilled in traditional Japanese arts and were not courtesans, as often misunderstood!"
        },
        {
          "word": "DOJO",
          "translations": {
            "en": "DOJO",
            "tr": "DOJO"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ is a training hall for martial arts.",
            "Where did samurai practice swordsmanship? The _____"
          ],
          "didYouKnow": "Dojo means 'place of the way'. It was not just a place for physical training but also for spiritual development!"
        },
        {
          "word": "HAIKU",
          "translations": {
            "en": "HAIKU",
            "tr": "HAİKU"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ is a short poem with three lines.",
            "What type of poetry captures nature and emotions? A _____"
          ],
          "didYouKnow": "Haiku poems have a strict structure: 5 syllables in the first line, 7 in the second, and 5 in the third. They often include a 'kigo' (seasonal word)!"
        },
        {
          "word": "SHINTO",
          "translations": {
            "en": "SHINTO",
            "tr": "ŞİNTO"
          },
          "difficulty": "normal",
          "sentences": [
            "_____ is the traditional religion of Japan.",
            "What belief system focuses on nature spirits? _____"
          ],
          "didYouKnow": "Shinto means 'the way of the gods'. It teaches that everything in nature has a spirit, called kami, and emphasizes purity and harmony with nature!"
        },
        {
          "word": "SUSHI",
          "translations": {
            "en": "SUSHI",
            "tr": "SUŞİ"
          },
          "difficulty": "easy",
          "sentences": [
            "_____ is a traditional Japanese dish made with rice and fish.",
            "What food is often served with soy sauce and wasabi? _____"
          ],
          "didYouKnow": "Sushi originally started as a way to preserve fish in fermented rice. The rice was thrown away until someone decided to eat it with the fish!"
        }
      ]
    },
    {
      "era": "Ottoman Empire",
      "words": [
        {
          "word": "SULTAN",
          "translations": {
            "en": "SULTAN",
            "tr": "SULTAN"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ was the ruler of the Ottoman Empire.",
            "Who was the head of both government and religion? The _____"
          ],
          "didYouKnow": "The Ottoman sultans were also caliphs, the spiritual leaders of all Muslims. This gave them both political and religious authority!"
        },
        {
          "word": "JANISSARY",
          "translations": {
            "en": "JANISSARY",
            "tr": "YENİÇERİ"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ were elite soldiers of the Ottoman army.",
            "Who were the Sultan's personal bodyguards? The _____"
          ],
          "didYouKnow": "Janissaries were originally Christian boys taken from their families, converted to Islam, and trained as soldiers. They were forbidden to marry or have children!"
        },
        {
          "word": "MOSQUE",
          "translations": {
            "en": "MOSQUE",
            "tr": "CAMİ"
          },
          "difficulty": "easy",
          "sentences": [
            "A _____ is a place of worship for Muslims.",
            "What building has a minaret and a dome? The _____"
          ],
          "didYouKnow": "The Hagia Sophia in Istanbul was originally a church, then a mosque, and now a museum. Its massive dome was an engineering marvel of its time!"
        },
        {
          "word": "BAZAAR",
          "translations": {
            "en": "BAZAAR",
            "tr": "PAZAR"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ was a busy marketplace in Ottoman cities.",
            "Where did people buy and sell goods in the Ottoman Empire? The _____"
          ],
          "didYouKnow": "The Grand Bazaar in Istanbul is one of the oldest and largest covered markets in the world, with over 4,000 shops and 61 streets!"
        },
        {
          "word": "TURBAN",
          "translations": {
            "en": "TURBAN",
            "tr": "SARIK"
          },
          "difficulty": "normal",
          "sentences": [
            "The _ was a headgear worn by religious and high-ranking individuals in the Ottoman period.",
            "What headgear in the Ottoman Empire indicated status and profession? _"
          ],
          "didYouKnow": "The turban was not just a headgear in the Ottoman period but also an important symbol that indicated a person's status, profession, and religious position. Its colors and shapes provided information about the wearer's identity!"
        },
        {
          "word": "MINARET",
          "translations": {
            "en": "MINARET",
            "tr": "MİNARE"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ was a tall tower used to call people to prayer.",
            "What part of a mosque is used for the call to prayer? The _____"
          ],
          "didYouKnow": "The Blue Mosque in Istanbul has six minarets, which was unusual at the time. The sultan had to build a seventh minaret at the Kaaba in Mecca to avoid criticism!"
        },
        {
          "word": "CARAVAN",
          "translations": {
            "en": "CARAVAN",
            "tr": "KERVAN"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ carried goods across the desert.",
            "What group of travelers moved goods along trade routes? The _____"
          ],
          "didYouKnow": "Ottoman caravans could have hundreds of camels, each carrying up to 500 pounds of goods. They were protected by armed guards against bandits!"
        },
        {
          "word": "HAMMAM",
          "translations": {
            "en": "HAMMAM",
            "tr": "HAMAM"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ was a public bathhouse in Ottoman cities.",
            "Where did people go to bathe and socialize? The _____"
          ],
          "didYouKnow": "Ottoman hammams were not just for bathing but also for socializing and conducting business. They were an important part of daily life!"
        },
        {
          "word": "TUGRA",
          "translations": {
            "en": "TUGRA",
            "tr": "TUĞRA"
          },
          "difficulty": "hard",
          "sentences": [
            "The _____ was the Sultan's official signature.",
            "What symbol represented the Sultan's authority? The _____"
          ],
          "didYouKnow": "The tughra was a highly stylized calligraphic design that included the sultan's name and titles. It was used on all official documents and coins!"
        },
        {
          "word": "COFFEE",
          "translations": {
            "en": "COFFEE",
            "tr": "KAHVE"
          },
          "difficulty": "easy",
          "sentences": [
            "What is the beverage in the Ottoman Empire, also known as 'my black pearl', prepared with rituals? _____",
            "What drink was first introduced to Europe through the Ottomans? _____"
          ],
          "didYouKnow": "The first coffeehouse in the world opened in Istanbul in 1554. Coffee was so important that a woman could divorce her husband if he didn't provide her with enough coffee!"
        },
        {
          "word": "TULIP",
          "translations": {
            "en": "TULIP",
            "tr": "LALE"
          },
          "difficulty": "easy",
          "sentences": [
            "The _____ flower was a symbol of the Ottoman Empire.",
            "What flower became famous during the Tulip Era? The _____"
          ],
          "didYouKnow": "The Tulip Era (1718-1730) was a time of peace and cultural flowering in the Ottoman Empire. Tulips were so valuable that they were used as currency!"
        },
        {
          "word": "KILIM",
          "translations": {
            "en": "KILIM",
            "tr": "KİLİM"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ is a traditional woven rug.",
            "What type of carpet was made by Ottoman artisans? The _____"
          ],
          "didYouKnow": "Ottoman kilims were made by women and often told stories through their patterns. Each region had its own unique designs and colors!"
        },
        {
          "word": "DIVAN",
          "translations": {
            "en": "DIVAN",
            "tr": "DİVAN"
          },
          "difficulty": "hard",
          "sentences": [
            "The _____ was the council of the Ottoman Empire.",
            "Where did the Sultan meet with his advisors? The _____"
          ],
          "didYouKnow": "The Divan was where the empire's most important decisions were made. The grand vizier, the sultan's chief minister, presided over the meetings!"
        },
        {
          "word": "KAFTAN",
          "translations": {
            "en": "KAFTAN",
            "tr": "KAFTAN"
          },
          "difficulty": "normal",
          "sentences": [
            "A _____ was a long robe worn by Ottoman royalty.",
            "What clothing item was a symbol of status in the Ottoman court? The _____"
          ],
          "didYouKnow": "Ottoman sultans wore kaftans made of the finest silk and brocade, often embroidered with gold and silver thread. They were gifts to foreign dignitaries!"
        },
        {
          "word": "SEBIL",
          "translations": {
            "en": "SEBIL",
            "tr": "SEBİL"
          },
          "difficulty": "hard",
          "sentences": [
            "A _____ was a public fountain for drinking water.",
            "What structure provided water to people in Ottoman cities? The _____"
          ],
          "didYouKnow": "Sebils were often built as charitable acts by wealthy individuals. They provided free water to the public and were beautifully decorated with tiles and calligraphy!"
        },
        {
          "word": "BOSPHORUS",
          "translations": {
            "en": "BOSPHORUS",
            "tr": "BOĞAZ"
          },
          "difficulty": "normal",
          "sentences": [
            "The _____ is the strait that connects the Black Sea to the Sea of Marmara.",
            "What waterway runs through Istanbul? The _____"
          ],
          "didYouKnow": "The Bosphorus is one of the world's busiest waterways. It divides Europe and Asia and has been strategically important for thousands of years!"
        }
      ]
    }
  ]
}

           